## PASO 0: Importar bibliotecas y leer datos

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'dataset_raw\Portabilidad.csv')
df

      Año  Mes Personal   Claro  Nextel Movistar  Otros Periodo
0    2012    3      -17      19       0       -2    NaN  Mar-12
1    2012    4    3,508  -1,134    -189   -2,185    NaN  Apr-12
2    2012    5    1,253   4,792    -853   -5,192    NaN  May-12
3    2012    6    3,263  -1,248    -848   -1,167    NaN  Jun-12
4    2012    7    5,554  -3,847  -1,105     -602    NaN  Jul-12
..    ...  ...      ...     ...     ...      ...    ...     ...
123  2022    6   -3,012  20,311     NaN  -17,348   49.0  Jun-22
124  2022    7    2,263   7,363     NaN   -9,653   27.0  Jul-22
125  2022    8      996  19,548     NaN  -20,585   41.0  Aug-22
126  2022    9   -2,209  18,050     NaN  -15,982  141.0  Sep-22
127  2022   10   -1,605     987     NaN      469  149.0  Oct-22

[128 rows x 8 columns]

In [3]:
pd.set_option('display.max.columns', 200)
pd.set_option('display.max.rows', 200)

'''Pandas por defecto no te muestra todas las columnas del dataframe.
Es util para la exploracion de datos tener un limite bastante alto.
Correr despues de haber creado el dataframe, sino da error.
'''

'Pandas por defecto no te muestra todas las columnas del dataframe.\nEs util para la exploracion de datos tener un limite bastante alto.\nCorrer despues de haber creado el dataframe, sino da error.\n'

---

## PASO 1: Comprensión de datos

- Dataframe `info`
- Dataframe `shape`
- `head` y `tail`
- Duplicados

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Año       128 non-null    int64
 1   Mes       128 non-null    int64
 2   Personal  128 non-null    object
 3   Claro     128 non-null    object
 4   Nextel    70 non-null     object
 5   Movistar  128 non-null    object
 6   Otros     8 non-null      float64
 7   Periodo   128 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 8.1+ KB

In [5]:
df.shape

(128, 8)

In [6]:
# Verificar si hay filas completas duplicadas
duplicates = df[df.duplicated(keep=False, subset=df.columns)]
duplicates

Empty DataFrame
Columns: [Año, Mes, Personal, Claro, Nextel, Movistar, Otros, Periodo]
Index: []

In [7]:
df.drop_duplicates(inplace=True)

In [8]:
df.columns

Index(['Año', 'Mes', 'Personal', 'Claro', 'Nextel', 'Movistar', 'Otros',
       'Periodo'],
      dtype='object')

In [9]:
df.head(5)

    Año  Mes Personal   Claro  Nextel Movistar  Otros Periodo
0  2012    3      -17      19       0       -2    NaN  Mar-12
1  2012    4    3,508  -1,134    -189   -2,185    NaN  Apr-12
2  2012    5    1,253   4,792    -853   -5,192    NaN  May-12
3  2012    6    3,263  -1,248    -848   -1,167    NaN  Jun-12
4  2012    7    5,554  -3,847  -1,105     -602    NaN  Jul-12

---

## PASO 2: Preparación de datos

- Quitar columnas y filas irrelevantes
- Renombrar columnas
- Identificar columnas y filas duplicadas

In [10]:
df = df[['Año', 'Mes', 'Personal', 'Claro', 'Nextel', 'Movistar', 'Otros']]

df.head(5)

    Año  Mes Personal   Claro  Nextel Movistar  Otros
0  2012    3      -17      19       0       -2    NaN
1  2012    4    3,508  -1,134    -189   -2,185    NaN
2  2012    5    1,253   4,792    -853   -5,192    NaN
3  2012    6    3,263  -1,248    -848   -1,167    NaN
4  2012    7    5,554  -3,847  -1,105     -602    NaN

In [11]:
df.isna().sum()   # Checkeamos Nulos por columna

Año           0
Mes           0
Personal      0
Claro         0
Nextel       58
Movistar      0
Otros       120
dtype: int64

In [12]:
df.fillna(0,inplace=True)

C:\Users\Alan\AppData\Local\Temp\ipykernel_6644\1840858203.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.fillna(0,inplace=True)

In [13]:
df[['Personal', 'Claro', 'Nextel', 'Movistar']] = df[['Personal', 'Claro', 'Nextel', 'Movistar']].replace(",", "", regex=True).astype(int)

C:\Users\Alan\AppData\Local\Temp\ipykernel_6644\3566529477.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Personal', 'Claro', 'Nextel', 'Movistar']] = df[['Personal', 'Claro', 'Nextel', 'Movistar']].replace(",", "", regex=True).astype(int)

In [14]:
df.dtypes

Año           int64
Mes           int64
Personal      int32
Claro         int32
Nextel        int32
Movistar      int32
Otros       float64
dtype: object

In [15]:
df.head()

    Año  Mes  Personal  Claro  Nextel  Movistar  Otros
0  2012    3       -17     19       0        -2    0.0
1  2012    4      3508  -1134    -189     -2185    0.0
2  2012    5      1253   4792    -853     -5192    0.0
3  2012    6      3263  -1248    -848     -1167    0.0
4  2012    7      5554  -3847   -1105      -602    0.0

In [16]:
# Guardar DataFrame como un archivo CSV
df.to_csv(r'..\EDA\dataset_processed\Portabilidad_prces.csv', index=False)